Autodesk.Revit.DB.Events.LinkedResourceOpenedEventArgs.LinkedResourcePathName
Path of the linked resource.
Since:
2018

Autodesk.Revit.DB.Events.LinkedResourceOpenedEventArgs.ResourceType
The desired linked resource type.
Since:
2018

Autodesk.Revit.DB.Events.LinkedResourceOpenedEventArgs
The event arguments used by Autodesk::Revit::ApplicationServices::Application::LinkedResourceOpened.
Since:
2018